#!/usr/bin/ruby
# coding: utf-8

# tagged-text 로부터 MeCab용 corpus, kdic.csv를 만드는 소스

R_COL_SIZE = 3

# 세종 태그
POS_TABLE = {
	# 체언
		# 명사
	"일반명사" => "체언,명사,일반명사", # NNG
	"고유명사" => "체언,명사,고유명사", # NNP
	"의존명사" => "체언,명사,의존명사", # NNB
		# 대명사
	"대명사"   => "체언,대명사", # NP
		# 수사
	"수사"     => "체언,수사", # NR
    # 용언
        # 동사
    "동사"       => "용언,동사", #VV
        # 형용사
    "형용사"     => "용언,형용사", # VA
        # 보조용언
    "보조용언"   => "용언,보조용언", # VX
        # 지정사
    "긍정지정사" => "용언,지정사,긍정지정사", # VCP
    "부정지정사" => "용언,지정사,부정지정사", # VCN
    # 수식언
        # 관형사
    "관형사" => "수식언,관형사", # MM
        # 부사
    "일반부사" => "수식언,부사,일반부사", # MAG
    "접속부사" => "수식언,부사,접속부사", # MAJ
    # 독립언
    "감탄사" => "독립언,감탄사", # IC
    # 관계언
        # 격조사
    "주격조사" => "조사,격조사,주격조사", # JKS
    "보격조사" => "조사,격조사,보격조사", # JKC
    "관형격조사" => "조사,격조사,관형격조사", # JKG
    "목적격조사" => "조사,격조사,목적격조사", # JKO
    "부사격조사" => "조사,격조사,부사격조사", # JKB
    "호격조사" => "조사,격조사,호격조사", # JKV
    "인용격조사" => "조사,격조사,인용격조사", # JKQ
        # 보조사
    "보조사" => "조사,보조사", # JX
        # 접속조사
    "접속조사" => "조사,접속조사", # JC
    # 의존형태
        # 어미
    "선어말어미" => "의존형태,어미,선어말어미", # EP
    "종결어미" => "의존형태,어미,종결어미", # EF
    "연결어미" => "의존형태,어미,연결어미", # EC
    "명사형전성어미" => "의존형태,어미,명사형전성어미", # ETN
    "관형형전성어미" => "의존형태,어미,관형형전성어미", # ETM
        # 접두사
    "체언접두사" => "의존형태,접두사,체언접두사", # XPN
        # 접미사
    "명사파생접미사" => "의존형태,접미사,명사파생접미사", # XSN
    "동사파생접미사" => "의존형태,접미사,동사파생접미사", # XSV
    "형용사파생접미사" => "의존형태,접미사,형용사파생접미사", # XSA
        # 어근
    "어근" => "어근", # XR
    # 기호
    # TODO 이 부분은
    # mecab 의 char.def, unk.def, rewrite.def 에서 설정할 수 있다.
    # 추후 변경해야 한다.
        # 마침표,물음표,느낌표 SF
    "마침표" => "기호,마침표",
    "물음표" => "기호,물음표",
    "느낌표" => "기호,느낌표",
        # 쉼표,가운뎃점,콜론,빗금 SP
    "쉼표" => "기호,쉼표가운뎃점콜론빗금",
    "가운뎃점" => "기호,쉼표가운뎃점콜론빗금",
    "콜론" => "기호,쉼표가운뎃점콜론빗금",
    "빗금" => "기호,쉼표가운뎃점콜론빗금",
        # 따옴표,괄호표,줄표 # SS
    "따옴표" => "기호,따옴표괄호표줄표",
    "괄호표" => "기호,따옴표괄호표줄표",
    "줄표" => "기호,따옴표괄호표줄표",

    "줄임표" => "기호,줄임표", # SE
    "붙임표" => "기호,붙임표", # SO
    "외국어" => "기호,외국어", # SL
    "한자" => "기호,한자", # SH
    "기타" => "기호,기타", # SW
    "명사추정범주" => "기호,명사추정범주", # NF
    "용언추정범주" => "기호,용언추정범주", # NV
    "숫자" => "기호,숫자", # SN
    "분석불능범주" => "기호,분석불능범주", # NA
    # 분해 후 변하는 경우
    # 이렇게 일일이 작성하는 이유는 타이핑 에러를 감지하기 위함이다.
    "동사+연결어미"   => "동사+연결어미",
    "동사+선어말어미" => "동사+선어말어미",
    "동사+관형형전성어미" => "동사+관형형전성어미",
    "동사+종결어미" => "동사+종결어미",
    "동사파생접미사+관형형전성어미" => "동사파생접미사+관형형전성어미",
    "동사파생접미사+선어말어미" => "동사파생접미사+선어말어미",
    "동사파생접미사+종결어미" => "동사파생접미사+종결어미",

    "형용사+관형형전성어미" => "형용사+관형형전성어미",
    "형용사+연결어미" => "형용사+연결어미",
    "형용사+종결어미" => "형용사+종결어미",
    "형용사파생접미사+연결어미" => "형용사파생접미사+연결어미",
    "형용사파생접미사+관형형전성어미" => "형용사파생접미사+관형형전성어미",

    "보조사+관형형전성어미" => "보조사+관형형전성어미",
    "긍정지정사+종결어미" => "긍정지정사+종결어미",

    "보조용언+연결어미" => "보조용언+연결어미",
    "보조용언+선어말어미" => "보조용언+선어말어미",
    "보조용언+종결어미" => "보조용언+종결어미",
    "보조용언+관형형전성어미" => "보조용언+관형형전성어미",

    "명사형전성어미+목적격조사" => "명사형전성어미+목적격조사",

    "대명사+관형격조사" => "대명사+관형격조사",
    "선어말어미+관형형전성어미" => "선어말어미+관형형전성어미",
}

lines = []

File.open("./corpus", "w") do |corpus_file|
    File.open("tagged-text", "r").each_line do |line|
	    left, right = line.split("\t")
	    if left == "EOS\n"
	        # corpus file 에 출력
		    corpus_file.puts "EOS"
		    next
	    end

	    right.strip!
	    right = right.split(",")
	    pos = right[0]

        if right[1..-1].join(",").empty?
	        right = POS_TABLE[pos]
	    else
	        right = POS_TABLE[pos] + "," + right[1..-1].join(",")
	    end

	    # corpus file 에 출력
	    corpus_file.puts(left + "\t" + right + ",*" * (R_COL_SIZE - right.count(",") - 1))
	
	    # kdic.csv 를 위한 문자열 생성
	    # 쉽표(,) 제거, "0,0,0" 추가
	    unless left.include?(",")
	        lines << (left + ",0,0,0," + right + ",*" * (R_COL_SIZE - right.count(",") - 1))
	    end
    end
end

# 중복 제거, 정렬, kdic.csv 파일 쓰기
File.open("./seed/kdic.csv", "w") do |f|
	f.puts(lines.uniq!.sort!)
end
